hibernate.org
#+TITLE: Hibernate ORM



* 基本知识
ORM:
: Object-Relationship Mapping
对象，跟数据库，有着某种对应关系
| 类             | 表的结构(MetaData) |
| 实例化的对象   | 每一条数据         |
| 对象的每个属性 | 数据的每个字段     |

面向对象的封装，让我们在编程的过程中用更自然的思维处理问题，
所以在操作数据库的时候，需要把数据库里的数据跟我们创建的对象关联起来。
我们可以手动写代码实现这个过程。
也可以通过一些 ORM 框架去实现。Hibernate 就是其中一种非常优秀的框架。

