hibernate.html
<!DOCTYPE html>
<html>
<head>
<title>Hibernate ORM</title>
<!-- 2016-11-10 周四 06:39 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="imfine">
<link rel="stylesheet" href="ss.css">
</head>
<body>
<div id="content">
<h1 class="title">Hibernate ORM</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">基本知识</a></li>
<li><a href="#sec-2">起步</a></li>
<li><a href="#sec-3">Load/Get</a></li>
<li><a href="#sec-4">session.flush()</a></li>
<li><a href="#sec-5">session.refresh()</a></li>
<li><a href="#sec-6">session.clear()</a></li>
<li><a href="#sec-7">ManyToOne</a></li>
<li><a href="#sec-8">OneToMany</a>
<ul>
<li><a href="#sec-8-1">xml 中的配置</a></li>
<li><a href="#sec-8-2">注解的形式</a></li>
</ul>
</li>
<li><a href="#sec-9">One.Many.双向</a>
<ul>
<li><a href="#sec-9-1">在 xml 中配置</a></li>
<li><a href="#sec-9-2">通过注解的方式进行配置</a></li>
</ul>
</li>
<li><a href="#sec-10">Cascade</a></li>
<li><a href="#sec-11">Fetch</a></li>
<li><a href="#sec-12">Roll</a></li>
<li><a href="#sec-13">改写 hello，增加 hibernate 支持</a></li>
<li><a href="#sec-14">Java 提高</a>
<ul>
<li><a href="#sec-14-1">日期与时间</a>
<ul>
<li><a href="#sec-14-1-1">Date 类</a></li>
<li><a href="#sec-14-1-2">Calendar 类</a></li>
<li><a href="#sec-14-1-3">其它</a></li>
</ul>
</li>
<li><a href="#sec-14-2">getter 代码，实现更好的封装</a></li>
</ul>
</li>
</ul>
</div>
</nav>



<section id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">基本知识</h2>
<div class="outline-text-2" id="text-1">
<p>
ORM:
</p>
<pre class="example">
Object-Relationship Mapping
</pre>
<p>
对象，跟数据库，有着某种对应关系
</p>
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">类</td>
<td class="left">表的结构(MetaData)</td>
</tr>

<tr>
<td class="left">实例化的对象</td>
<td class="left">每一条数据</td>
</tr>

<tr>
<td class="left">对象的每个属性</td>
<td class="left">数据的每个字段</td>
</tr>
</tbody>
</table>

<p>
面向对象的封装，让我们在编程的过程中用更自然的思维处理问题，
所以在操作数据库的时候，需要把数据库里的数据跟我们创建的对象关联起来。
我们可以手动写代码实现这个过程。
也可以通过一些 ORM 框架去实现。Hibernate 就是其中一种非常优秀的框架。
</p>
</div>
</section>
