hibernate.html

<section id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">起步</h2>
<div class="outline-text-2" id="text-2">
<p>
使用 Hibernate 的步骤:
</p>

<ol class="org-ol">
<li>建立 Web 工程
</li>
<li>将需要用到的 jar 包，拷贝到 lib 包的下面。一定不要放错位置。也不要缺少关键包。也尽量不要有包的冲突。
</li>
<li>创建 hibernate 的配置文件 hibernate.cfg.xml，指定数据库信息、打印sql语句策略等
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #0000FF;">xml</span> <span style="color: #BA36A5;">version</span>=<span style="color: #008000;">"</span><span style="color: #008000;">1.0</span><span style="color: #008000;">"</span> <span style="color: #BA36A5;">encoding</span>=<span style="color: #008000;">"</span><span style="color: #008000;">UTF-8</span><span style="color: #008000;">"</span>?&gt;
&lt;!<span style="color: #0000FF;">DOCTYPE</span> hibernate-configuration <span style="color: #0000FF;">PUBLIC</span>
 <span style="color: #036A07;">"</span><span style="color: #036A07;">-//Hibernate/Hibernate Configuration DTD 3.0//EN</span><span style="color: #036A07;">"</span>
 <span style="color: #036A07;">"</span><span style="color: #036A07;">http://www.hibernate.org/dtd/hibernate-configuration-3.0.dtd</span><span style="color: #036A07;">"</span>&gt;

&lt;<span style="color: #000088; background-color: #DEDEDE;">hibernate-configuration</span>&gt;
  &lt;<span style="color: #000088; background-color: #DEDEDE;">session-factory</span>&gt;
     <span style="color: #8D8D84;">&lt;!--</span><span style="color: #8D8D84; font-style: italic;"> &#37197;&#32622;&#25968;&#25454;&#24211;&#30340;&#22522;&#26412;&#20449;&#24687; </span><span style="color: #8D8D84;">--&gt;</span>
     &lt;<span style="color: #000088; background-color: #DEDEDE;">property</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate.connection.driver_class</span><span style="color: #008000;">"</span>&gt;oracle.jdbc.driver.OracleDriver&lt;/<span style="color: #000088; background-color: #DEDEDE;">property</span>&gt;
     &lt;<span style="color: #000088; background-color: #DEDEDE;">property</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate.connection.url</span><span style="color: #008000;">"</span>&gt;jdbc:oracle:thin:@localhost:1521:orcl&lt;/<span style="color: #000088; background-color: #DEDEDE;">property</span>&gt;
     &lt;<span style="color: #000088; background-color: #DEDEDE;">property</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate.connection.username</span><span style="color: #008000;">"</span>&gt;vip&lt;/<span style="color: #000088; background-color: #DEDEDE;">property</span>&gt;
     &lt;<span style="color: #000088; background-color: #DEDEDE;">property</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate.connection.password</span><span style="color: #008000;">"</span>&gt;vip&lt;/<span style="color: #000088; background-color: #DEDEDE;">property</span>&gt;
     &lt;<span style="color: #000088; background-color: #DEDEDE;">property</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate.dialect</span><span style="color: #008000;">"</span>&gt;org.hibernate.dialect.Oracle10gDialect&lt;/<span style="color: #000088; background-color: #DEDEDE;">property</span>&gt;

     <span style="color: #8D8D84;">&lt;!--</span><span style="color: #8D8D84; font-style: italic;"> &#37197;&#32622; SQL &#35821;&#21477;&#26174;&#31034;&#25110;&#32773; DDL &#29983;&#25104;&#30340;&#31574;&#30053; </span><span style="color: #8D8D84;">--&gt;</span>
     &lt;<span style="color: #000088; background-color: #DEDEDE;">property</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate.show_sql</span><span style="color: #008000;">"</span>&gt;true&lt;/<span style="color: #000088; background-color: #DEDEDE;">property</span>&gt;
     &lt;<span style="color: #000088; background-color: #DEDEDE;">property</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate.format_sql</span><span style="color: #008000;">"</span>&gt;true&lt;/<span style="color: #000088; background-color: #DEDEDE;">property</span>&gt;
     &lt;<span style="color: #000088; background-color: #DEDEDE;">property</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate.hbm2ddl.auto</span><span style="color: #008000;">"</span>&gt;create&lt;/<span style="color: #000088; background-color: #DEDEDE;">property</span>&gt;

     <span style="color: #8D8D84;">&lt;!--</span><span style="color: #8D8D84; font-style: italic;"> &#37197;&#32622;&#19968;&#31995;&#21015;&#30340; Mapping &#25991;&#20214;&#12290;&#20998;&#20026; xml/annotation &#31561;&#26041;&#24335; </span><span style="color: #8D8D84;">--&gt;</span>        
     &lt;<span style="color: #000088; background-color: #DEDEDE;">mapping</span> <span style="color: #BA36A5;">resource</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate/helloworld/Book.hbm.xml</span><span style="color: #008000;">"</span> /&gt;
     &lt;<span style="color: #000088; background-color: #DEDEDE;">mapping</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate.helloworld.Book</span><span style="color: #008000;">"</span> /&gt;

  &lt;/<span style="color: #000088; background-color: #DEDEDE;">session-factory</span>&gt;
&lt;/<span style="color: #000088; background-color: #DEDEDE;">hibernate-configuration</span>&gt;
</pre>
</div>
</li>
<li>创建实体类 Book.java
<blockquote>
<p>
注意，要写成 JavaBean 的规范格式。字段用 private 限制，并为每个字段写 getter/setter 方法(property accessor)。
</p>

<p>
还要注意，一个实体类，要跟数据库做映射的话，有一个字段是必须的，就是主键，在 hibernate 中，用 @Id 来表示。
</p>

<p>
还要注意，一个实体类，必须要有一个无参构造器。如果我们在里面写了带参数的构造器，那一定不要忘记，增加一个默认的无参构造器。
</p>
</blockquote>
</li>

<li>创建数据库跟实体类的映射。有两种方式：XML方式、Annotation方式
<ol class="org-ol">
<li>创建相关的xml映射文件 Book.hbm.xml
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #0000FF;">xml</span> <span style="color: #BA36A5;">version</span>=<span style="color: #008000;">"</span><span style="color: #008000;">1.0</span><span style="color: #008000;">"</span> <span style="color: #BA36A5;">encoding</span>=<span style="color: #008000;">"</span><span style="color: #008000;">UTF-8</span><span style="color: #008000;">"</span>?&gt;
&lt;!<span style="color: #0000FF;">DOCTYPE</span> hibernate-mapping <span style="color: #0000FF;">PUBLIC</span> 
    <span style="color: #036A07;">"</span><span style="color: #036A07;">-//Hibernate/Hibernate Mapping DTD 3.0//EN</span><span style="color: #036A07;">"</span>
    <span style="color: #036A07;">"</span><span style="color: #036A07;">http://www.hibernate.org/dtd/hibernate-mapping-3.0.dtd</span><span style="color: #036A07;">"</span>&gt;

&lt;<span style="color: #000088; background-color: #DEDEDE;">hibernate-mapping</span>&gt;
  <span style="color: #8D8D84;">&lt;!--</span><span style="color: #8D8D84; font-style: italic;"> &#37197;&#32622;&#23454;&#20307;&#31867;&#30340;&#26144;&#23556; </span><span style="color: #8D8D84;">--&gt;</span>
  &lt;<span style="color: #000088; background-color: #DEDEDE;">class</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">hibernate.helloworld.Book</span><span style="color: #008000;">"</span> <span style="color: #BA36A5;">table</span>=<span style="color: #008000;">"</span><span style="color: #008000;">t_book</span><span style="color: #008000;">"</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">id</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">bookno</span><span style="color: #008000;">"</span>&gt;
      &lt;<span style="color: #000088; background-color: #DEDEDE;">generator</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"</span><span style="color: #008000;">native</span><span style="color: #008000;">"</span>&gt;&lt;/<span style="color: #000088; background-color: #DEDEDE;">generator</span>&gt;
    &lt;/<span style="color: #000088; background-color: #DEDEDE;">id</span>&gt;

    &lt;<span style="color: #000088; background-color: #DEDEDE;">property</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">name</span><span style="color: #008000;">"</span>&gt;&lt;/<span style="color: #000088; background-color: #DEDEDE;">property</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">property</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">price</span><span style="color: #008000;">"</span>&gt;&lt;/<span style="color: #000088; background-color: #DEDEDE;">property</span>&gt;
  &lt;/<span style="color: #000088; background-color: #DEDEDE;">class</span>&gt;

  <span style="color: #8D8D84;">&lt;!--</span><span style="color: #8D8D84; font-style: italic;"> &#22312;&#36825;&#37324;&#65292;&#21487;&#20197;&#28155;&#21152;&#20854;&#20182;&#30340;&#23454;&#20307;&#31867;&#26144;&#23556; </span><span style="color: #8D8D84;">--&gt;</span>

&lt;/<span style="color: #000088; background-color: #DEDEDE;">hibernate-mapping</span>&gt;
</pre>
</div>
</li>

<li>在实体类上加相关的注解
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">@Entity 注解</td>
<td class="left">用来标识类是一个与数据库关联的实体类。这个注解作用在类上面。</td>
</tr>

<tr>
<td class="left">@Id 注解</td>
<td class="left">让hibernate把当前属性解析为一个主键</td>
</tr>

<tr>
<td class="left">@Basic 注解</td>
<td class="left">用来表示，让 hibernate 把当前属性解析为一个表的普通字段。要注意，如果有些java基本类型，没有任何注解的话，默认是带有 @Basic 注解的。</td>
</tr>

<tr>
<td class="left">@Table 注解</td>
<td class="left">用来自定义生成表的详细信息的。作用在类上面。必须要联合 @Entity 注解一起使用。</td>
</tr>

<tr>
<td class="left">@Column 注解</td>
<td class="left">用来自定义生成字段的详细信息的。可选的，配合 @Id 或 @Basic 一起使用。</td>
</tr>

<tr>
<td class="left">@GeneratedValue 注解</td>
<td class="left">用来自定义主键的自动生成策略，如果不带任何参数，那么默认的策略是 AUTO，即让 Hibernate 自动选择生成主键值的方法。这个注解要跟 @Id 一起配合使用。一般情况下，这个也是不可或缺的。</td>
</tr>

<tr>
<td class="left">@Transient 注解</td>
<td class="left">用来将指定属性排除掉，不进行持久化</td>
</tr>
</tbody>
</table>
</li>
</ol>
</li>

<li>在 hibernate.cfg.xml 中添加映射，开始连接
<ol class="org-ol">
<li>创建 sessionFactory
<pre class="example">
他就是一个大内总管，负责初始化 hibernate，并携带所有的配置信息，而且要负责我们跟数据库打交道的一切杂务。
</pre>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#21152;&#36733;&#37197;&#32622;&#25991;&#20214;</span>
<span style="color: #6434A3;">Configuration</span> <span style="color: #BA36A5;">config</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Configuration</span><span style="color: #707183;">()</span>.configure<span style="color: #707183;">(</span> <span style="color: #008000;">"/hibernate/helloworld/hello.cfg.xml"</span><span style="color: #707183;">)</span>;
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#21021;&#22987;&#21270;&#25152;&#26377;&#38656;&#35201;&#30340;&#26381;&#21153;</span>
<span style="color: #6434A3;">ServiceRegistry</span> <span style="color: #BA36A5;">serviceRegistry</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">StandardServiceRegistryBuilder</span><span style="color: #707183;">()</span>.applySettings<span style="color: #707183;">(</span>config.getProperties<span style="color: #7388D6;">()</span><span style="color: #707183;">)</span>.build<span style="color: #707183;">()</span>;

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#22312;&#23436;&#25104; sessionFactory &#30340;&#21019;&#24314;&#20043;&#21069;&#65292;&#21487;&#20197;&#36890;&#36807; config.addXXX &#30340;&#26041;&#24335;&#65292;&#21160;&#24577;&#28155;&#21152;&#23454;&#20307;&#31867;&#30340;&#26144;&#23556;&#20449;&#24687;</span>
config.addAnnotatedClass<span style="color: #707183;">(</span>Author.<span style="color: #0000FF;">class</span><span style="color: #707183;">)</span>;
config.addResource<span style="color: #707183;">(</span><span style="color: #008000;">"hibernate/helloworld/Book.hbm.xml"</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#21019;&#24314; sessionFactory &#23545;&#35937;</span>
<span style="color: #6434A3;">SessionFactory</span> <span style="color: #BA36A5;">sessionFactory</span> = config.buildSessionFactory<span style="color: #707183;">(</span>serviceRegistry<span style="color: #707183;">)</span>;
</pre>
</div>
</li>

<li>创建 session
</li>
<li>创建 Transaction
</li>
<li>通过 Query 等进行查询；通过 save/delete 等进行增删。
</li>
<li>提交事务，关闭 session，关闭 SessionFactory。
</li>
</ol>
</li>
</ol>
</div>
</section>
