hibernate.org
* Load/Get
get 跟 load 的区别如下：
1. 如果查询的数据不存在的话，get 会返回 null；load 会抛出异常。
2. get 是立即从数据库中检索数据； load 是懒加载，即只有当要使用对象的时刻，才进行加载，懒加载是通过代理实现的。


* session.flush()

是让 hibernate 立即执行 sql 语句，但是并不提交，同时更新session缓存。{即同步 session 里的缓存到数据库（插入，更新，删除等）。}

: 只有在调用了 session.flush() 之后，session缓存里的数据，才会被发送到数据库，进行真正的数据库持久化操作。

以下几种清空可以调用 flush:
1. 我们可以在代码中显式调用。在调用的时候，会向数据库中发送操作指令。
   : session.flush();

2. 我们在调用 commit 的时候，也会隐式调用 flush 方法。
   : session.commit();
   commit() 方法，其实就是简单调用了 session.flush() 和 conn.commit()。所以数据会被同步到数据库，而且，事务会提交。

3. 在执行查询的时候，会隐式调用 flush 方法.
   #+BEGIN_SRC java
   @Test
   public void testFlush() {
  		// 更新缓存
  		Author author = new Author();
  		author.setName("struts....");
  		author.setBirth(new Date());
  		
  		// 数据只是存在于 session 的缓存中
  		session.save(author);

      // 从数据库中进行 query 查询的时候，会触发 flush 语句。  		
  		Query query = session.createQuery("from Author");
  		System.out.println(query.list().size());
  		
  		System.out.println("ssss");
  	}
   #+END_SRC


* session.refresh()

在查询的时候，从数据库中更新数据。

所以 refresh 会触发一次查询操作，保证取到的是跟数据库中一致的数据。


* session.clear()

清空整个的 session 缓存内容。


h* Assoc
因为，在数据库中，存在多张表，表根表之间通过外键的形式进行的关联。

但是，在我们的java中，存在的是多个类，类之间是通过互相引用的形式进行沟通。（即一个类中，包含另一个类的引用）。

ORM 的主要是，用面向对象的思维去操作数据库。所以，我们在操作java中的对象，或者修改java中对象之间的关系的时候，ORM 框架能够把我们对对象的修改转换为数据库中表的修改。

所以，我们需要在 java 中设置类之间的相互关系，那么，ORM 框架（hibernate）才能够正确的进行这种转换。

即，hibernate 会根据我们设置的 ManyToOne 等设置，生成正确的表跟表之间的关联。还能够在我们增删改查的时候，根据我们的设置，生成正确的 sql 语句。

所以，不管通过xml还是annotation的形式，你要告诉 hibernate 类之间的关系，他才能在你调用类似 session.save(对象) 的方法时，生成正确的语句并插入数据库。

目前为止，先模仿，后理解。练习越多，越明白。只看不练，空把式。


* ManyToOne
如果一个实体类拥有一个属性，这个属性是另外一个实体类的引用，
那么就不能简单用 @Basic 注解或者 <property /> 标签去定义这个属性跟数据库中表的字段之间的映射关系。
#+BEGIN_SRC java
// 例如，一本书，肯定有一个作者，而 author 属性不是一个简单类型，而是一个对象的引用。
// 书跟作者是一个一对一的关系，也就是一本书，只有一个作者
class Book {
  private Author author;
}
#+END_SRC
在这种情况之下，我们需要用 @ManyToOne 注解 或者用 <many-to-one /> 标签去定义这个属性跟表字段之间的映射。


many-to-one，这个标签的作用是为所在的列，添加一个外键约束。如果不显式指定 column 名字的话，那么默认生成的名字是 属性名_索引的主键名

many-to-one 标签内可以设置 lazy=(false|proxy|no-proxy), fetch=(select|join)。

lazy 通过设置为 false 或其他，定义是否要进行懒加载。如果设置为 false，不会启用懒加载，否则，则会启用懒加载。
懒加载是通过创建代理对象的形式去实现的，所以需要用到字节码编译的技术。
lazy=proxy，那么当设置为懒加载的属性被调用的时候，才会触发查询操作。
lazy=no-proxy，那么当被调用的时候，未必会去查询，只有当调用的语句中使用到数据库里存的数据的时候，才会真正的去数据库查询。
所以，它是加强版的懒加载。lazy=no-proxy需要额外的字节码增强的设置，否则会跟 proxy 一致。

fetch 设置立即加载组织成的查询语句的策略，如果设置为 join，那么会组织成一条 left-join 语句，
如果是 select，那么会组织成若干条独立的查询语句，会查询多次。




* OneToMany
** xml 中的配置
#+BEGIN_SRC xml
<set name="books" cascade="save-update" lazy="extra" fetch="select">
	<key column="authorid"></key>
	<one-to-many class="Book" />
</set>
#+END_SRC

lazy 有下面几个选项： false/true/extra。默认是 true。
- 如果设置为 false，那么立即加载，加载的方式是多条 select 语句。
- 如果设置为 true，会启用懒加载。只有在调用 books 的任何方法时，才会去初始化列表，从而触发从数据库中查询图书列表的请求。
- 如果设置为 extra，也会启用懒加载，但是是更加智能化的懒加载。这时候，如果去调用 books.size() 或 books.contains() 等方法时，并不会真正的初始化图书列表。这样能尽可能节省资源。


fetch 有以下几个选项：
- 如果设置了 select，那么，查询的是多条 select 语句。这是默认值。
- 如果设置了 join，那么 lazy 的设置会无效，会变成立即加载。加载的语句为 left join 方式
- 如果设置了 subselect ....
  #+BEGIN_SRC sql
  -- 如果查询到多条数据，每条数据中都含有一个一对多的关联数据，那么初始化这些关联数据时：
  
  -- 如果设置为 select，那么分别发送一条语句去查询。
  select * from book books0_ where books0_.authorid = 4;
  select * from book books0_ where books0_.authorid = 1;
  -- 可能还有很多很多条
  
  -- 如果设置为 subselect，组织成一条语句去查询。会更加节省资源。
  select *
    from book books0_
   where books0_.authorid in (select author0_.aid from author author0_);
  #+END_SRC




** 注解的形式
#+BEGIN_SRC java
@OneToMany(cascade=CascadeType.ALL, fetch=FetchType.LAZY)
@Fetch(FetchMode.JOIN)
@JoinColumn(name="authorid")
private Set<Book> books = new HashSet<Book>();
#+END_SRC

必须要注明 @JoinColumn，否则，会生成中间表来存储关联关系。 @JoinColumn 是用来订制生成的外键字段的。

通过 cascade 可以设置级联属性；通过 fetch 可以设置是否采用懒加载；通过 @Fetch 注解可以指定查询语句的形式。

注解的形式在某种意义上跟 xml 形式是对应的。


* One.Many.双向
