hibernate.html



<section id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Load/Get</h2>
<div class="outline-text-2" id="text-3">
<p>
get 跟 load 的区别如下：
</p>
<ol class="org-ol">
<li>如果查询的数据不存在的话，get 会返回 null；load 会抛出异常。
</li>
<li>get 是立即从数据库中检索数据； load 是懒加载，即只有当要使用对象的时刻，才进行加载，懒加载是通过代理实现的。
</li>
</ol>
</div>
</section>


<section id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">session.flush()</h2>
<div class="outline-text-2" id="text-4">
<p>
是让 hibernate 立即执行 sql 语句，但是并不提交，同时更新session缓存。{即同步 session 里的缓存到数据库（插入，更新，删除等）。}
</p>

<pre class="example">
只有在调用了 session.flush() 之后，session缓存里的数据，才会被发送到数据库，进行真正的数据库持久化操作。
</pre>

<p>
以下几种清空可以调用 flush:
</p>
<ol class="org-ol">
<li>我们可以在代码中显式调用。在调用的时候，会向数据库中发送操作指令。
<pre class="example">
session.flush();
</pre>
</li>

<li>我们在调用 commit 的时候，也会隐式调用 flush 方法。
<pre class="example">
session.commit();
</pre>
<p>
commit() 方法，其实就是简单调用了 session.flush() 和 conn.commit()。所以数据会被同步到数据库，而且，事务会提交。
</p>
</li>

<li>在执行查询的时候，会隐式调用 flush 方法.
<div class="org-src-container">

<pre class="src src-java"><span style="color: #D0372D;">@Test</span>
<span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">testFlush</span><span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
   <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#26356;&#26032;&#32531;&#23384;</span>
   <span style="color: #6434A3;">Author</span> <span style="color: #BA36A5;">author</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Author</span><span style="color: #7388D6;">()</span>;
   author.setName<span style="color: #7388D6;">(</span><span style="color: #008000;">"struts...."</span><span style="color: #7388D6;">)</span>;
   author.setBirth<span style="color: #7388D6;">(</span><span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Date</span><span style="color: #909183;">()</span><span style="color: #7388D6;">)</span>;

   <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#25968;&#25454;&#21482;&#26159;&#23384;&#22312;&#20110; session &#30340;&#32531;&#23384;&#20013;</span>
   session.save<span style="color: #7388D6;">(</span>author<span style="color: #7388D6;">)</span>;

   <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#20174;&#25968;&#25454;&#24211;&#20013;&#36827;&#34892; query &#26597;&#35810;&#30340;&#26102;&#20505;&#65292;&#20250;&#35302;&#21457; flush &#35821;&#21477;&#12290;     </span>
   <span style="color: #6434A3;">Query</span> <span style="color: #BA36A5;">query</span> = session.createQuery<span style="color: #7388D6;">(</span><span style="color: #008000;">"from Author"</span><span style="color: #7388D6;">)</span>;
   System.out.println<span style="color: #7388D6;">(</span>query.list<span style="color: #909183;">()</span>.size<span style="color: #909183;">()</span><span style="color: #7388D6;">)</span>;

   System.out.println<span style="color: #7388D6;">(</span><span style="color: #008000;">"ssss"</span><span style="color: #7388D6;">)</span>;
 <span style="color: #707183;">}</span>
</pre>
</div>
</li>
</ol>
</div>
</section>


<section id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">session.refresh()</h2>
<div class="outline-text-2" id="text-5">
<p>
在查询的时候，从数据库中更新数据。
</p>

<p>
所以 refresh 会触发一次查询操作，保证取到的是跟数据库中一致的数据。
</p>
</div>
</section>


<section id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">session.clear()</h2>
<div class="outline-text-2" id="text-6">
<p>
清空整个的 session 缓存内容。
</p>


<p>
h* Assoc
因为，在数据库中，存在多张表，表根表之间通过外键的形式进行的关联。
</p>

<p>
但是，在我们的java中，存在的是多个类，类之间是通过互相引用的形式进行沟通。（即一个类中，包含另一个类的引用）。
</p>

<p>
ORM 的主要是，用面向对象的思维去操作数据库。所以，我们在操作java中的对象，或者修改java中对象之间的关系的时候，ORM 框架能够把我们对对象的修改转换为数据库中表的修改。
</p>

<p>
所以，我们需要在 java 中设置类之间的相互关系，那么，ORM 框架（hibernate）才能够正确的进行这种转换。
</p>

<p>
即，hibernate 会根据我们设置的 ManyToOne 等设置，生成正确的表跟表之间的关联。还能够在我们增删改查的时候，根据我们的设置，生成正确的 sql 语句。
</p>

<p>
所以，不管通过xml还是annotation的形式，你要告诉 hibernate 类之间的关系，他才能在你调用类似 session.save(对象) 的方法时，生成正确的语句并插入数据库。
</p>

<p>
目前为止，先模仿，后理解。练习越多，越明白。只看不练，空把式。
</p>
</div>
</section>


<section id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">ManyToOne</h2>
<div class="outline-text-2" id="text-7">
<p>
如果一个实体类拥有一个属性，这个属性是另外一个实体类的引用，
那么就不能简单用 @Basic 注解或者 &lt;property /&gt; 标签去定义这个属性跟数据库中表的字段之间的映射关系。
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#20363;&#22914;&#65292;&#19968;&#26412;&#20070;&#65292;&#32943;&#23450;&#26377;&#19968;&#20010;&#20316;&#32773;&#65292;&#32780; author &#23646;&#24615;&#19981;&#26159;&#19968;&#20010;&#31616;&#21333;&#31867;&#22411;&#65292;&#32780;&#26159;&#19968;&#20010;&#23545;&#35937;&#30340;&#24341;&#29992;&#12290;</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#20070;&#36319;&#20316;&#32773;&#26159;&#19968;&#20010;&#19968;&#23545;&#19968;&#30340;&#20851;&#31995;&#65292;&#20063;&#23601;&#26159;&#19968;&#26412;&#20070;&#65292;&#21482;&#26377;&#19968;&#20010;&#20316;&#32773;</span>
<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Book</span> <span style="color: #707183;">{</span>
  <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Author</span> <span style="color: #BA36A5;">author</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
<p>
在这种情况之下，我们需要用 @ManyToOne 注解 或者用 &lt;many-to-one /&gt; 标签去定义这个属性跟表字段之间的映射。
</p>


<p>
many-to-one，这个标签的作用是为所在的列，添加一个外键约束。如果不显式指定 column 名字的话，那么默认生成的名字是 属性名_索引的主键名
</p>

<p>
many-to-one 标签内可以设置 lazy=(false|proxy|no-proxy), fetch=(select|join)。
</p>

<p>
lazy 通过设置为 false 或其他，定义是否要进行懒加载。如果设置为 false，不会启用懒加载，否则，则会启用懒加载。
懒加载是通过创建代理对象的形式去实现的，所以需要用到字节码编译的技术。
lazy=proxy，那么当设置为懒加载的属性被调用的时候，才会触发查询操作。
lazy=no-proxy，那么当被调用的时候，未必会去查询，只有当调用的语句中使用到数据库里存的数据的时候，才会真正的去数据库查询。
所以，它是加强版的懒加载。lazy=no-proxy需要额外的字节码增强的设置，否则会跟 proxy 一致。
</p>

<p>
fetch 设置立即加载组织成的查询语句的策略，如果设置为 join，那么会组织成一条 left-join 语句，
如果是 select，那么会组织成若干条独立的查询语句，会查询多次。
</p>
</div>
</section>




<section id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">OneToMany</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">xml 中的配置</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #000088; background-color: #DEDEDE;">set</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">books</span><span style="color: #008000;">"</span> <span style="color: #BA36A5;">cascade</span>=<span style="color: #008000;">"</span><span style="color: #008000;">save-update</span><span style="color: #008000;">"</span> <span style="color: #BA36A5;">lazy</span>=<span style="color: #008000;">"</span><span style="color: #008000;">extra</span><span style="color: #008000;">"</span> <span style="color: #BA36A5;">fetch</span>=<span style="color: #008000;">"</span><span style="color: #008000;">select</span><span style="color: #008000;">"</span>&gt;
  &lt;<span style="color: #000088; background-color: #DEDEDE;">key</span> <span style="color: #BA36A5;">column</span>=<span style="color: #008000;">"</span><span style="color: #008000;">authorid</span><span style="color: #008000;">"</span>&gt;&lt;/<span style="color: #000088; background-color: #DEDEDE;">key</span>&gt;
  &lt;<span style="color: #000088; background-color: #DEDEDE;">one-to-many</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"</span><span style="color: #008000;">Book</span><span style="color: #008000;">"</span> /&gt;
&lt;/<span style="color: #000088; background-color: #DEDEDE;">set</span>&gt;
</pre>
</div>

<p>
lazy 有下面几个选项： false/true/extra。默认是 true。
</p>
<ul class="org-ul">
<li>如果设置为 false，那么立即加载，加载的方式是多条 select 语句。
</li>
<li>如果设置为 true，会启用懒加载。只有在调用 books 的任何方法时，才会去初始化列表，从而触发从数据库中查询图书列表的请求。
</li>
<li>如果设置为 extra，也会启用懒加载，但是是更加智能化的懒加载。这时候，如果去调用 books.size() 或 books.contains() 等方法时，并不会真正的初始化图书列表。这样能尽可能节省资源。
</li>
</ul>


<p>
fetch 有以下几个选项：
</p>
<ul class="org-ul">
<li>如果设置了 select，那么，查询的是多条 select 语句。这是默认值。
</li>
<li>如果设置了 join，那么 lazy 的设置会无效，会变成立即加载。加载的语句为 left join 方式
</li>
<li>如果设置了 subselect &#x2026;.
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #8D8D84; font-style: italic;">-- &#22914;&#26524;&#26597;&#35810;&#21040;&#22810;&#26465;&#25968;&#25454;&#65292;&#27599;&#26465;&#25968;&#25454;&#20013;&#37117;&#21547;&#26377;&#19968;&#20010;&#19968;&#23545;&#22810;&#30340;&#20851;&#32852;&#25968;&#25454;&#65292;&#37027;&#20040;&#21021;&#22987;&#21270;&#36825;&#20123;&#20851;&#32852;&#25968;&#25454;&#26102;&#65306;</span>

<span style="color: #8D8D84; font-style: italic;">-- &#22914;&#26524;&#35774;&#32622;&#20026; select&#65292;&#37027;&#20040;&#20998;&#21035;&#21457;&#36865;&#19968;&#26465;&#35821;&#21477;&#21435;&#26597;&#35810;&#12290;</span>
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> book books0_ <span style="color: #0000FF;">where</span> books0_.authorid = 4;
<span style="color: #0000FF;">select</span> * <span style="color: #0000FF;">from</span> book books0_ <span style="color: #0000FF;">where</span> books0_.authorid = 1;
<span style="color: #8D8D84; font-style: italic;">-- &#21487;&#33021;&#36824;&#26377;&#24456;&#22810;&#24456;&#22810;&#26465;</span>

<span style="color: #8D8D84; font-style: italic;">-- &#22914;&#26524;&#35774;&#32622;&#20026; subselect&#65292;&#32452;&#32455;&#25104;&#19968;&#26465;&#35821;&#21477;&#21435;&#26597;&#35810;&#12290;&#20250;&#26356;&#21152;&#33410;&#30465;&#36164;&#28304;&#12290;</span>
<span style="color: #0000FF;">select</span> *
  <span style="color: #0000FF;">from</span> book books0_
 <span style="color: #0000FF;">where</span> books0_.authorid <span style="color: #0000FF;">in</span> <span style="color: #707183;">(</span><span style="color: #0000FF;">select</span> author0_.aid <span style="color: #0000FF;">from</span> author author0_<span style="color: #707183;">)</span>;
</pre>
</div>
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2">注解的形式</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #D0372D;">@OneToMany</span><span style="color: #707183;">(</span>cascade=<span style="color: #D0372D;">CascadeType</span>.ALL, fetch=<span style="color: #D0372D;">FetchType</span>.LAZY<span style="color: #707183;">)</span>
<span style="color: #D0372D;">@Fetch</span><span style="color: #707183;">(</span><span style="color: #D0372D;">FetchMode</span>.<span style="color: #6434A3;">JOIN</span><span style="color: #707183;">)</span>
<span style="color: #D0372D;">@JoinColumn</span><span style="color: #707183;">(</span>name=<span style="color: #008000;">"authorid"</span><span style="color: #707183;">)</span>
<span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Set</span><span style="color: #707183;">&lt;</span><span style="color: #6434A3;">Book</span><span style="color: #707183;">&gt;</span> <span style="color: #BA36A5;">books</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashSet</span><span style="color: #707183;">&lt;</span><span style="color: #6434A3;">Book</span><span style="color: #707183;">&gt;()</span>;
</pre>
</div>

<p>
必须要注明 @JoinColumn，否则，会生成中间表来存储关联关系。 @JoinColumn 是用来订制生成的外键字段的。
</p>

<p>
通过 cascade 可以设置级联属性；通过 fetch 可以设置是否采用懒加载；通过 @Fetch 注解可以指定查询语句的形式。
</p>

<p>
注解的形式在某种意义上跟 xml 形式是对应的。
</p>
</div>
</div>
</section>
