hibernate.org
** 在 xml 中配置
#+BEGIN_SRC xml
<set name="books" inverse="true">
	<key column="authorid"></key>
	<one-to-many class="Book" />
</set>

<many-to-one name="author" column="authorid" class="Author"></many-to-one>
#+END_SRC

首先，必须要保证 上面的 column 跟下面的 column 要一致，否则，会在创建表的时候，生成重复的字段，产生不必要的问题。

其次，要在 set 上面配置 inverse="true"，否则，会在生成语句的时候，产生很多很多的冗余。在一对多双向关系中，一般情况下，要在多的一边设置 inverse。

ps：如果设置了 inverse=true，那么会将另一边设为主端，负责关系的维护。
也就是说，当执行 session.save(author) 的时候，不去维护 authorid 的信息；而当执行 session.save(book) 的时候，才去维护 authorid 的信息。
这样，多的一方维护关系，从而减轻了维护成本，提高了效率。（想想习大大跟我们的例子）。

还要注意，在保存的时候，要先保存 1 的一方，否则，会产生很多不必要的 update 语句，从而影响效率。


** 通过注解的方式进行配置
在双边分别这样配置：
#+BEGIN_SRC java
// @JoinColumn(name="authorid") 这个不需要去写，因为 mappedBy 会默认触发外键操作
@OneToMany(mappedBy="author")   // author 对应的是 book 里面的 author 属性
private Set<Book> books = new HashSet<Book>();


@ManyToOne
@JoinColumn(name="authorid")
private Author author;
#+END_SRC

首先，上边跟下边的 JoinColumn 值的名字，需要一致

其次，要在 @OneToMany 里面设置 mappedBy 属性，将双方关系的控制权交给另外一边。

最后，保存的时候，注意顺序，要先保存 1 的一边。



* Cascade
级联。
在利用 hibernate 对实体类对象进行持久化(如 session.save)的时候，需要保证里面引用的对象已经处于持久化状态。

否则，会出现以下异常
: org.hibernate.TransientObjectException: object references an unsaved transient instance - save the transient instance before flushing: hibernate.assoc.many2one.Author

解决方案有以下两种：
1. 在保存对象前，对所有引用到的对象先执行持久化操作。
2. 在实体类中，为这些引用到的对象，设置合适的级联属性。这样的话，hibernate 会在保存对象的时候，自动将引用到的还没有持久化的对象进行持久化。

级联可以通过注解的形式进行配置，也可以通过 XML 的形式进行配置。
: @ManyToOne(cascade=CascadeType.PERSIST)
: <many-to-one cascade="save-update" />

大抵有如下几种：
: none：在保存，删除或修改当前对象时，不对其附属对象（关联对象）进行级联操作，它是默认值。 
: save-update：在保存，更新当前对象时，级联保存，更新附属对象（临时对象、游离对象）。 
: delete：在删除当前对象时，级联删除附属对象。 
: all：所有情况下均进行级联操作，即包含 save-update 和 delete 操作


在我们的开发环境中，设置好 cascade 会让我们的代码更整洁，测试更方便。但是，在工业环境中，不建议使用任何 cascade 设置。

* Fetch
注解配置，有两种 FetchType.EAGER/FetchType.Lazy，分别对应立即加载和惰性加载。

* Roll
6. query 对象, hql
3. Many to one 关系。包括配置，使用
9. One to Many 关系。包括配置，使用





* 改写 hello，增加 hibernate 支持
* Java 提高


** 日期与时间
*** Date 类
这是 java 最开始就有的类，用来处理时间。
#+BEGIN_SRC java
// 获取当前时间
Date now = new Date();
// 打印时间，显式格式为 Thu Nov 03 16:31:56 CST 2016
System.out.println(now);
// 获取时间中的年、月、日等
System.out.println(now.getYear()); // 注意，这样得到的是一个减去了 1990 的年份。
// 得到从 1970 年到现在经过的毫秒数
System.out.println(now.getTime());
// 所以得到两个时间相差多少一般这样表示
long duration = date1.getTime() - date2.getTime();

// 得到指定日期的时间
Date time1 = new Date(12212221);
Date time2 = new Date("19900202");
Date time3 = new Date(1990, 1, 14);  // 注意，月份从0开始计算。1这条语句表示 1990年2月14日
// 通过 SimpleDateFormat 的形式得到指定格式的日期
Date time4 = new SimpleDateFormat("yyyyMMdd").parse("20050205");

#+END_SRC

