hibernate.html


<section id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">One.Many.双向</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">在 xml 中配置</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #000088; background-color: #DEDEDE;">set</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">books</span><span style="color: #008000;">"</span> <span style="color: #BA36A5;">inverse</span>=<span style="color: #008000;">"</span><span style="color: #008000;">true</span><span style="color: #008000;">"</span>&gt;
  &lt;<span style="color: #000088; background-color: #DEDEDE;">key</span> <span style="color: #BA36A5;">column</span>=<span style="color: #008000;">"</span><span style="color: #008000;">authorid</span><span style="color: #008000;">"</span>&gt;&lt;/<span style="color: #000088; background-color: #DEDEDE;">key</span>&gt;
  &lt;<span style="color: #000088; background-color: #DEDEDE;">one-to-many</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"</span><span style="color: #008000;">Book</span><span style="color: #008000;">"</span> /&gt;
&lt;/<span style="color: #000088; background-color: #DEDEDE;">set</span>&gt;

&lt;<span style="color: #000088; background-color: #DEDEDE;">many-to-one</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"</span><span style="color: #008000;">author</span><span style="color: #008000;">"</span> <span style="color: #BA36A5;">column</span>=<span style="color: #008000;">"</span><span style="color: #008000;">authorid</span><span style="color: #008000;">"</span> <span style="color: #BA36A5;">class</span>=<span style="color: #008000;">"</span><span style="color: #008000;">Author</span><span style="color: #008000;">"</span>&gt;&lt;/<span style="color: #000088; background-color: #DEDEDE;">many-to-one</span>&gt;
</pre>
</div>

<p>
首先，必须要保证 上面的 column 跟下面的 column 要一致，否则，会在创建表的时候，生成重复的字段，产生不必要的问题。
</p>

<p>
其次，要在 set 上面配置 inverse="true"，否则，会在生成语句的时候，产生很多很多的冗余。在一对多双向关系中，一般情况下，要在多的一边设置 inverse。
</p>

<p>
ps：如果设置了 inverse=true，那么会将另一边设为主端，负责关系的维护。
也就是说，当执行 session.save(author) 的时候，不去维护 authorid 的信息；而当执行 session.save(book) 的时候，才去维护 authorid 的信息。
这样，多的一方维护关系，从而减轻了维护成本，提高了效率。（想想习大大跟我们的例子）。
</p>

<p>
还要注意，在保存的时候，要先保存 1 的一方，否则，会产生很多不必要的 update 语句，从而影响效率。
</p>
</div>
</div>


<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2">通过注解的方式进行配置</h3>
<div class="outline-text-3" id="text-9-2">
<p>
在双边分别这样配置：
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">@JoinColumn(name="authorid") &#36825;&#20010;&#19981;&#38656;&#35201;&#21435;&#20889;&#65292;&#22240;&#20026; mappedBy &#20250;&#40664;&#35748;&#35302;&#21457;&#22806;&#38190;&#25805;&#20316;</span>
<span style="color: #D0372D;">@OneToMany</span><span style="color: #707183;">(</span>mappedBy=<span style="color: #008000;">"author"</span><span style="color: #707183;">)</span>   <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">author &#23545;&#24212;&#30340;&#26159; book &#37324;&#38754;&#30340; author &#23646;&#24615;</span>
<span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Set</span><span style="color: #707183;">&lt;</span><span style="color: #6434A3;">Book</span><span style="color: #707183;">&gt;</span> <span style="color: #BA36A5;">books</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashSet</span><span style="color: #707183;">&lt;</span><span style="color: #6434A3;">Book</span><span style="color: #707183;">&gt;()</span>;


<span style="color: #D0372D;">@ManyToOne</span>
<span style="color: #D0372D;">@JoinColumn</span><span style="color: #707183;">(</span>name=<span style="color: #008000;">"authorid"</span><span style="color: #707183;">)</span>
<span style="color: #0000FF;">private</span> <span style="color: #6434A3;">Author</span> <span style="color: #BA36A5;">author</span>;
</pre>
</div>

<p>
首先，上边跟下边的 JoinColumn 值的名字，需要一致
</p>

<p>
其次，要在 @OneToMany 里面设置 mappedBy 属性，将双方关系的控制权交给另外一边。
</p>

<p>
最后，保存的时候，注意顺序，要先保存 1 的一边。
</p>
</div>
</div>
</section>



<section id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Cascade</h2>
<div class="outline-text-2" id="text-10">
<p>
级联。
在利用 hibernate 对实体类对象进行持久化(如 session.save)的时候，需要保证里面引用的对象已经处于持久化状态。
</p>

<p>
否则，会出现以下异常
</p>
<pre class="example">
org.hibernate.TransientObjectException: object references an unsaved transient instance - save the transient instance before flushing: hibernate.assoc.many2one.Author
</pre>

<p>
解决方案有以下两种：
</p>
<ol class="org-ol">
<li>在保存对象前，对所有引用到的对象先执行持久化操作。
</li>
<li>在实体类中，为这些引用到的对象，设置合适的级联属性。这样的话，hibernate 会在保存对象的时候，自动将引用到的还没有持久化的对象进行持久化。
</li>
</ol>

<p>
级联可以通过注解的形式进行配置，也可以通过 XML 的形式进行配置。
</p>
<pre class="example">
@ManyToOne(cascade=CascadeType.PERSIST)
&lt;many-to-one cascade="save-update" /&gt;
</pre>

<p>
大抵有如下几种：
</p>
<pre class="example">
none：在保存，删除或修改当前对象时，不对其附属对象（关联对象）进行级联操作，它是默认值。 
save-update：在保存，更新当前对象时，级联保存，更新附属对象（临时对象、游离对象）。 
delete：在删除当前对象时，级联删除附属对象。 
all：所有情况下均进行级联操作，即包含 save-update 和 delete 操作
</pre>


<p>
在我们的开发环境中，设置好 cascade 会让我们的代码更整洁，测试更方便。但是，在工业环境中，不建议使用任何 cascade 设置。
</p>
</div>
</section>

<section id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Fetch</h2>
<div class="outline-text-2" id="text-11">
<p>
注解配置，有两种 FetchType.EAGER/FetchType.Lazy，分别对应立即加载和惰性加载。
</p>
</div>
</section>

<section id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Roll</h2>
<div class="outline-text-2" id="text-12">
<ol class="org-ol">
<li>query 对象, hql
</li>
<li>Many to one 关系。包括配置，使用
</li>
<li>One to Many 关系。包括配置，使用
</li>
</ol>
</div>
</section>





<section id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">改写 hello，增加 hibernate 支持</h2>
</section>
<section id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">Java 提高</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1">日期与时间</h3>
<div class="outline-text-3" id="text-14-1">
</div><div id="outline-container-sec-14-1-1" class="outline-4">
<h4 id="sec-14-1-1">Date 类</h4>
<div class="outline-text-4" id="text-14-1-1">
<p>
这是 java 最开始就有的类，用来处理时间。
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#33719;&#21462;&#24403;&#21069;&#26102;&#38388;</span>
<span style="color: #6434A3;">Date</span> <span style="color: #BA36A5;">now</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Date</span><span style="color: #707183;">()</span>;
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#25171;&#21360;&#26102;&#38388;&#65292;&#26174;&#24335;&#26684;&#24335;&#20026; Thu Nov 03 16:31:56 CST 2016</span>
System.out.println<span style="color: #707183;">(</span>now<span style="color: #707183;">)</span>;
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#33719;&#21462;&#26102;&#38388;&#20013;&#30340;&#24180;&#12289;&#26376;&#12289;&#26085;&#31561;</span>
System.out.println<span style="color: #707183;">(</span>now.getYear<span style="color: #7388D6;">()</span><span style="color: #707183;">)</span>; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#27880;&#24847;&#65292;&#36825;&#26679;&#24471;&#21040;&#30340;&#26159;&#19968;&#20010;&#20943;&#21435;&#20102; 1990 &#30340;&#24180;&#20221;&#12290;</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#24471;&#21040;&#20174; 1970 &#24180;&#21040;&#29616;&#22312;&#32463;&#36807;&#30340;&#27627;&#31186;&#25968;</span>
System.out.println<span style="color: #707183;">(</span>now.getTime<span style="color: #7388D6;">()</span><span style="color: #707183;">)</span>;
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#25152;&#20197;&#24471;&#21040;&#20004;&#20010;&#26102;&#38388;&#30456;&#24046;&#22810;&#23569;&#19968;&#33324;&#36825;&#26679;&#34920;&#31034;</span>
<span style="color: #6434A3;">long</span> <span style="color: #BA36A5;">duration</span> = date1.getTime<span style="color: #707183;">()</span> - date2.getTime<span style="color: #707183;">()</span>;

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#24471;&#21040;&#25351;&#23450;&#26085;&#26399;&#30340;&#26102;&#38388;</span>
<span style="color: #6434A3;">Date</span> <span style="color: #BA36A5;">time1</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Date</span><span style="color: #707183;">(</span>12212221<span style="color: #707183;">)</span>;
<span style="color: #6434A3;">Date</span> <span style="color: #BA36A5;">time2</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Date</span><span style="color: #707183;">(</span><span style="color: #008000;">"19900202"</span><span style="color: #707183;">)</span>;
<span style="color: #6434A3;">Date</span> <span style="color: #BA36A5;">time3</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Date</span><span style="color: #707183;">(</span>1990, 1, 14<span style="color: #707183;">)</span>;  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#27880;&#24847;&#65292;&#26376;&#20221;&#20174;0&#24320;&#22987;&#35745;&#31639;&#12290;1&#36825;&#26465;&#35821;&#21477;&#34920;&#31034; 1990&#24180;2&#26376;14&#26085;</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#36890;&#36807; SimpleDateFormat &#30340;&#24418;&#24335;&#24471;&#21040;&#25351;&#23450;&#26684;&#24335;&#30340;&#26085;&#26399;</span>
<span style="color: #6434A3;">Date</span> <span style="color: #BA36A5;">time4</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">SimpleDateFormat</span><span style="color: #707183;">(</span><span style="color: #008000;">"yyyyMMdd"</span><span style="color: #707183;">)</span>.parse<span style="color: #707183;">(</span><span style="color: #008000;">"20050205"</span><span style="color: #707183;">)</span>;
</pre>
</div>
</div>
</div>
