hibernate.html

<div id="outline-container-sec-14-1-2" class="outline-4">
<h4 id="sec-14-1-2">Calendar 类</h4>
<div class="outline-text-4" id="text-14-1-2">
<p>
后来由于 Date 类在处理国际化方面的一些局限，现在推荐用 Calendar 类代替 Date 类。
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#33719;&#21462;&#24403;&#21069;&#26102;&#38388;</span>
<span style="color: #6434A3;">Calendar</span> <span style="color: #BA36A5;">c</span> = Calendar.getInstance<span style="color: #707183;">()</span>;
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#36890;&#36807; getTime &#33719;&#24471; Date &#23545;&#35937;&#12290;&#36890;&#36807;&#19979;&#38754;&#35821;&#21477;&#65292;&#25171;&#21360;&#24403;&#21069;&#26102;&#38388;</span>
System.out.println<span style="color: #707183;">(</span>c.getTime<span style="color: #7388D6;">()</span><span style="color: #707183;">)</span>;
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#36890;&#36807;&#19979;&#38754;&#35821;&#21477;&#65292;&#33719;&#21462;&#24180;&#26376;&#26085;&#31561;</span>
System.out.println<span style="color: #707183;">(</span>c.get<span style="color: #7388D6;">(</span><span style="color: #D0372D;">Calendar</span>.YEAR<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>;

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#36890;&#36807;&#19979;&#38754;&#35821;&#21477;&#65292;&#21021;&#22987;&#21270;&#19968;&#20010;&#20855;&#20307;&#26102;&#38388;</span>
c.set<span style="color: #707183;">(</span>1999, 2, 4<span style="color: #707183;">)</span>;
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#25110;&#32773;&#36890;&#36807;&#26102;&#38388;&#31867;&#22411;&#24471;&#21040;</span>
c.setTime<span style="color: #707183;">(</span><span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Date</span><span style="color: #7388D6;">()</span><span style="color: #707183;">)</span>;
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#25110;&#32773;&#65292;&#36890;&#36807;&#30452;&#25509;&#23454;&#20363;&#21270;&#19968;&#20010; Calendar &#30340;&#23454;&#29616;&#31867;&#65306;</span>
<span style="color: #6434A3;">Calendar</span> <span style="color: #BA36A5;">cc</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">GregorianCalendar</span><span style="color: #707183;">(</span>1998,3,11<span style="color: #707183;">)</span>;
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#19979;&#38754;&#35821;&#21477;&#24471;&#21040; 1970 &#24180;&#26469;&#30340; long &#20540;</span>
System.out.println<span style="color: #707183;">(</span>cc.getTimeInMillis<span style="color: #707183;">)</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-14-1-3" class="outline-4">
<h4 id="sec-14-1-3">其它</h4>
<div class="outline-text-4" id="text-14-1-3">
<p>
通过以上代码看以看到，通过 calendar.setTime()/getTime() 方法可以实现 Date/Calendar 对象的转换。
</p>

<p>
另外，为了方便， System 下面有个静态方法，也可以获取 1970 年到现在过了多少毫秒，返回时 long 值：、
</p>
<pre class="example">
System.currentTimeMillis();
</pre>
<p>
这个非常常用。
</p>
</div>
</div>
</div>



<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2">getter 代码，实现更好的封装</h3>
<div class="outline-text-3" id="text-14-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #D0372D;">@Test</span>
<span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">testGetterDate</span><span style="color: #707183;">()</span> <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">Exception</span> <span style="color: #707183;">{</span>
  <span style="color: #6434A3;">Author</span> <span style="color: #BA36A5;">author</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Author</span><span style="color: #7388D6;">()</span>;
  author.setName<span style="color: #7388D6;">(</span><span style="color: #008000;">"&#24352;&#19977;"</span><span style="color: #7388D6;">)</span>;
  author.setBirth<span style="color: #7388D6;">(</span><span style="color: #0000FF;">new</span> <span style="color: #6434A3;">SimpleDateFormat</span><span style="color: #909183;">(</span><span style="color: #008000;">"yyyy-MM-dd"</span><span style="color: #909183;">)</span>.parse<span style="color: #909183;">(</span><span style="color: #008000;">"1993-04-14"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>;

  System.out.println<span style="color: #7388D6;">(</span><span style="color: #008000;">"&#29992;&#25143;&#21019;&#24314;&#25104;&#21151;&#12290;"</span><span style="color: #7388D6;">)</span>;

  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#25509;&#19979;&#26469;&#33719;&#21462;&#24180;&#40836;&#65292;&#26377;&#22914;&#19979;&#26041;&#24335;&#65306;</span>

  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#31532;&#19968;&#31181;&#20889;&#27861;&#65306;</span>
  System.out.println<span style="color: #7388D6;">(</span><span style="color: #008000;">"1. &#24180;&#40836;&#65306;"</span> + <span style="color: #909183;">(</span><span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Date</span><span style="color: #709870;">()</span>.getYear<span style="color: #709870;">()</span> - author.getBirth<span style="color: #709870;">()</span>.getYear<span style="color: #709870;">()</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>;

  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#31532;&#20108;&#31181;&#26041;&#27861;&#65292;&#21019;&#24314;&#19968;&#20010;&#38745;&#24577;&#26041;&#27861;&#65292;&#36890;&#36807;&#35843;&#29992;&#65292;&#33719;&#21462;&#24180;&#40836;&#65306;</span>
  System.out.println<span style="color: #7388D6;">(</span><span style="color: #008000;">"2. &#24180;&#40836;&#65306;"</span> + BirthUtil.calAge<span style="color: #909183;">(</span>author.getBirth<span style="color: #709870;">()</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>;

  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#31532;&#19977;&#31181;&#65292;&#22312; author &#31867;&#20013;&#65292;&#22686;&#21152;&#24180;&#40836;&#23383;&#27573;&#12290;&#22240;&#20026;&#24180;&#40836;&#20063;&#26159;&#20154;&#30340;&#19968;&#20010;&#23646;&#24615;&#12290;</span>
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#36825;&#26679;&#33021;&#26356;&#22909;&#30340;&#20307;&#29616;&#38754;&#21521;&#23545;&#35937;&#30340;&#24605;&#24819;&#65306;&#23553;&#35013;&#12290;</span>
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#22240;&#20026;&#24180;&#40836;&#36319;&#29983;&#26085;&#26377;&#20851;&#31995;&#65292;&#25152;&#20197;&#19981;&#38656;&#35201;&#26174;&#24335;&#36171;&#20540;&#65292;&#22914;&#26524;&#24819;&#33719;&#21462;&#65292;&#37027;&#20040;&#36890;&#36807;&#19979;&#38754;&#30340;&#26041;&#24335;&#65306;</span>
  System.out.println<span style="color: #7388D6;">(</span><span style="color: #008000;">"3. &#24180;&#40836;&#65306;"</span> + author.getAge<span style="color: #909183;">()</span><span style="color: #7388D6;">)</span>;
<span style="color: #707183;">}</span>


<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#22312; getter &#26041;&#27861;&#20013;&#65292;&#21487;&#20197;&#20889;&#19968;&#20123;&#20855;&#20307;&#30340;&#36923;&#36753;&#12290;</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#36825;&#37324;&#36890;&#36807;&#29983;&#26085;&#30340;&#23383;&#27573;&#65292;&#35745;&#31639;&#24180;&#40836;&#12290;&#24403;&#35843;&#29992;&#36825;&#20010; getter &#26041;&#27861;&#30340;&#26102;&#20505;&#65292;&#25165;&#24320;&#22987;&#35745;&#31639;&#12290;</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#32780;&#24180;&#40836;&#36825;&#20010;&#20540;&#65292;&#19981;&#38656;&#35201;&#20445;&#23384;&#21040;&#25968;&#25454;&#24211;&#20013;&#12290;&#25152;&#20197;&#19978;&#38754;&#38656;&#35201;&#22686;&#21152;&#19968;&#20010; @Transient &#27880;&#35299;&#65292;&#23558;&#20854;&#25490;&#20986;&#22312;&#22806;&#12290;</span>
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#36825;&#31181;&#22788;&#29702;&#26041;&#24335;&#65292;&#26159;&#38750;&#24120;&#24120;&#35265;&#30340;&#12290;&#23588;&#20854;&#22312; getter/setter &#26041;&#27861;&#20013;&#65292;&#28155;&#21152;&#33258;&#24049;&#30340;&#36923;&#36753;&#65292;&#26377;&#26102;&#20505;&#65292;&#20250;&#20351;&#20195;&#30721;&#21464;&#24471;&#20415;&#25463;&#12290;</span>
<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Author</span> <span style="color: #707183;">{</span>
  <span style="color: #0000FF;">private</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">age</span>;
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">... others</span>
  <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">getAge</span><span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span>
    <span style="color: #0000FF;">return</span> age == 0 ? BirthUtil.calAge<span style="color: #909183;">(</span>birth<span style="color: #909183;">)</span> : age;
  <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>


<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">&#26681;&#25454;&#29983;&#26085;&#35745;&#31639;&#24180;&#40836;&#30340;&#38745;&#24577;&#26041;&#27861;</span>
<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">BirthUtil</span> <span style="color: #707183;">{</span>
  <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">calAge</span><span style="color: #7388D6;">(</span><span style="color: #6434A3;">Date</span> <span style="color: #BA36A5;">birth</span><span style="color: #7388D6;">)</span> <span style="color: #7388D6;">{</span>
    <span style="color: #6434A3;">Calendar</span> <span style="color: #BA36A5;">cal</span> = Calendar.getInstance<span style="color: #909183;">()</span>;
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">now</span> = cal.get<span style="color: #909183;">(</span><span style="color: #D0372D;">Calendar</span>.YEAR<span style="color: #909183;">)</span>;
    cal.setTime<span style="color: #909183;">(</span>birth<span style="color: #909183;">)</span>;
    <span style="color: #0000FF;">return</span> now - cal.get<span style="color: #909183;">(</span><span style="color: #D0372D;">Calendar</span>.YEAR<span style="color: #909183;">)</span>;
  <span style="color: #7388D6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: imfine</p>
<p class="date">Created: 2016-11-10 周四 06:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
